{
  "results": [{
    "id": "rhetorical-analysis",
    "title": "rhetorical analysis",
    "content": "The picture of Plato’s great work called “Allegory of the Cave” reveals a lot more information than you think. First of all, how do you understand reality? What is a reality? This kind of questions was looping through the minds of people from the earliest time. I am pretty sure that you will think about it too. Maybe already have thought. So let’s do some analysis! First, what is theme, time and location? You might think that this image is from the very very past, approximately first or second centuries because of two people (e.g. their clothes) and plain land. Speaking of the land, the top side of the picture is more like a landscape theme. However, the bottom side is different. You may say very different. So what about it? The first interpretation of the bottom part might be very confusing, it really is. That’s why you may not be able to predict the location. I cannot predict it too.\nNow let’s look at interactivity. What do you think who is the audience? It is also quite confusing, right? This is because we have not discussed the meaning behind. So far we only know about two contrasting with each other sides. As you can see, there are some lines. Most of them are dash lines but not the middle one which is a divider. Now we may presume that two sides depict some two different worlds, two different men. The upper man seems to be a decent citizen while the lower is tied with ropes or chained and without clothes. Most importantly, the fire in the middle catches our focus. Through this fire, the chained man sees his shadow. So it is a kind of wall and the place is a kind of cave. Now we may assume that this is a horrifying situation of a prisoner where what he can see is only his shadow. The upper part is just the landscape with the sun on focus. Do you see how we interacted with the picture? Exciting, right? We are like in a guessing game.\nIn fact, the painting shows the true presence of reality. The trapped man in the bottom thinks that the shadow is real because he does not know about the world on the top. The sun here is knowledge, and it is a great metaphor. The thing is that the chained man does not see the sun, which basically means he has no knowledge. Overall, the purpose of this drawing is to tell the viewer that the truth of reality is hidden, and the only way to discover it is not through observing the world around, but through knowledge, through education. To sum up, we might now presume that the audience is every person on this planet, especially, those who ask themselves the questions in my introduction.\nPointing to intertextuality, it seems to me that color pick is good. As we now understand the purpose and identified the audience, we can evaluate the painter’s creation. The first point to mention is the lines. All of these lines help the reader to understand the context better. The second one is the two men in different conditions. I just noticed that the lower man’s head is colored the same as the background which is truly awesome. Thinking man has no knowledge, so I think the author tried to show it to the viewer. Other things are the sun and the color gradients. How real is the picture? The pink gradient shows some effect of the fire whereas the reflection of the tree might indicate some sort of realness. Speaking of the sun, do you see how massive is the sun? Maybe I am overthinking, but it might be that the author wants us to understand - the most focusing element has such a deep meaning behind.\nAfter analyzing this picture, you may wonder what a talented artist was to paint this masterpiece. Surfing the web to find similar pictures is easy, but the key point - do they differ? To be honest, nope. Nevertheless, it is always simplicity over mess when it comes to such deep paintings.\nTo sum up, I think this kind of pictures should always exist, and we should keep trying to understand what is behind!",
    "image": "/static/icons/posts/Allegory_of_the_Cave_blank.png",
    "meta": {
      "description": "Disclaimer: this post is written for my university course SHSS 240: Writing for Digital Media. And it's my first attempt to try digital rhetoric :)",
      "link": "",
      "linkDescription": "",
      "published": "2019-08-25T12:29:00Z"
    }
  }]
}
