{
  "results": [{
    "id": "why-computer-science",
    "title": "why computer science?",
    "content": "Facebook, Instagram and Whatsapp are globally down now, so it’s a good time to answer “Why I majored in Computer Science” and share my story. Wait, story… it doesn’t actually seem like a story since “my story” is kinda default one.\nLike most programmers in their past, I used to play a lot of video games. Yeah, I belong to one of the last generations that played Playstation 1, 2 and PC games such as Mortal Combat, FIFA (starting from 2004), Counter Strike 1.6, WarCraft 3: Frozen Throne (Dota), etc. The latter three were my main sources of spending time, like MineCraft for every child now, in middle and high school. It might be stereotypical to think that if you play games well in your childhood, then you will code well. Even though gaming doesn’t help with programming, there are some pros like training logical abilities and curiosity, imho. For example, when playing online, there were some top level guys who I somewhat admired and tried to learn their technic. You might think this is childhood stuff, but the same curiosity remained now in the programming world.\nProblem solving is another point. I used to fix something in my computer a lot, from some program/game specific stuff to global issues. The interesting fact - I loved doing that. I really did. I remember myself reading bunch of internet forums all night. That also helped to train my ‘googling’ which is very important in the life of a programmer. I believe that every programmer should know when and how to use it (one interesting link regarding this is provided below).\nAt my high school, I did some projects during the CS course, one of which I recently recalled with phrase: “wow, we played with database.” Two things to mention about my high school CS experience: only theory about the CS fundamentals with no practice, but good practice in developing stuff with no theory.\nAt my university, everything is okay so far. I like the curriculum: different CS and Software Engineering concepts with good practice. Here I wanna mention some misconceptions about programming. Software Engineering and Computer Science are slightly different things. Computer Science is more general, while Software Engineering is more industry-based. The thing is that university is not required to teach you how to develop a website or game or any other software. There is no meaning in doing so because technologies change every day. What is not changing are the main concepts such as data structures, algorithms, design patterns, database, networks and so on. These topics are, obviously, very hard (as everything in programming :)) but very important because you will then understand how things work and how you are developing those apps. That’s why, I like my department :)\nTherefore, I can say that computer science is more than just a major for me. To be honest, it wasn’t that hard to choose major after all; however, major may not be what you are gonna do in future. I’ve recently met ex-head of my high school, great man, and his words about job are kept in mind - if you love what you do and it’s financially satisfying, then that’s your perfect job. Things might change as time goes by, so anyway “do what you love and love what you do” perfectly fits here :)",
    "image": "/static/icons/posts/hackNU19.jpg",
    "meta": {
      "description": "",
      "link": "https://news.ycombinator.com/item?id=11603078",
      "linkDescription": "About using google",
      "published": "2019-07-03T12:29:00Z"
    }
  }]
}
